<?php

namespace Modules\Manage\Models\Report;

use Modules\Manage\Models\Model;

class LeaseLogisticsStockLog extends Model
{
    const LOG_TYPE_ARR = [
        '0'  => '全新电池物流从仓库补货',
        '1'  => '备用电池物流从仓库补货',
        '2'  => '全新电池物流配送退库',
        '3'  => '备用电池物流配送退库',
        '4'  => '废旧电池物流取回退回仓库',
        '5'  => '全新电池物流取回退回仓库',
        '6'  => '备用电池物流取回退回仓库',
        '7'  => '退回电池物流取回退回仓库',
        '8'  => '废旧电池物流取回',
        '9'  => '全新电池物流取回',
        '10' => '备用电池物流取回',
        '11' => '退回电池物流取回',
        '12' => '全新电池物流配送到网点',
        '13' => '备用电池物流配送到网点'
    ];
}
